; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	thermograph2 - mode
	image3 - mode
	infrared1 - mode
	spectrograph4 - mode
	infrared0 - mode
	Star1 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	Star2 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 infrared0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(supports instrument3 infrared1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument4 infrared1)
	(supports instrument4 image3)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 Star0)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument7 image3)
	(calibration_target instrument7 Star2)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph4)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Phenomenon9)
	(pointing satellite1 Star4)
	(pointing satellite4 Star11)
	(have_image Star5 image3)
	(have_image Planet6 infrared1)
	(have_image Phenomenon7 infrared1)
	(have_image Star8 image3)
	(have_image Star10 thermograph2)
	(have_image Star11 infrared1)
	(have_image Planet13 spectrograph4)
	(have_image Planet14 thermograph2)
	(have_image Phenomenon15 infrared0)
	(have_image Planet16 image3)
	(have_image Star17 infrared0)
))

(:metric minimize (total-time))
)

; plan
1. (switch-on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 14
2. (switch-on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 14
3. (switch-on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 14
4. (turn-to satellite4 star11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 star11)
   goals met: 1 of 14
5. (turn-to satellite2 phenomenon15 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 14
6. (turn-to satellite2 star2 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 star2)
   goals met: 1 of 14
7. (calibrate satellite2 instrument4 star2)
   added: (calibrated instrument4)
   goals met: 1 of 14
8. (turn-to satellite2 phenomenon15 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon15)
   goals met: 1 of 14
9. (take-image satellite2 phenomenon15 instrument4 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 2 of 14
10. (turn-to satellite2 phenomenon7 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 14
11. (take-image satellite2 phenomenon7 instrument4 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 14
12. (turn-to satellite2 planet16 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet16)
   goals met: 3 of 14
13. (take-image satellite2 planet16 instrument4 image3)
   added: (have_image planet16 image3)
   goals met: 4 of 14
14. (turn-to satellite2 planet6 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet6)
   goals met: 4 of 14
15. (take-image satellite2 planet6 instrument4 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 5 of 14
16. (turn-to satellite2 star11 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star11)
   goals met: 5 of 14
17. (take-image satellite2 star11 instrument4 infrared1)
   added: (have_image star11 infrared1)
   goals met: 6 of 14
18. (turn-to satellite2 star17 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star17)
   goals met: 6 of 14
19. (take-image satellite2 star17 instrument4 infrared0)
   added: (have_image star17 infrared0)
   goals met: 7 of 14
20. (turn-to satellite2 star5 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star5)
   goals met: 7 of 14
21. (take-image satellite2 star5 instrument4 image3)
   added: (have_image star5 image3)
   goals met: 8 of 14
22. (turn-to satellite2 star8 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 star8)
   goals met: 8 of 14
23. (take-image satellite2 star8 instrument4 image3)
   added: (have_image star8 image3)
   goals met: 9 of 14
24. (turn-to satellite1 planet13 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet13)
   goals met: 9 of 14
25. (turn-to satellite0 phenomenon9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon9)
   goals met: 10 of 14
26. (turn-to satellite1 star0 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star0)
   goals met: 10 of 14
27. (calibrate satellite1 instrument3 star0)
   added: (calibrated instrument3)
   goals met: 10 of 14
28. (turn-to satellite1 planet13 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet13)
   goals met: 10 of 14
29. (take-image satellite1 planet13 instrument3 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 11 of 14
30. (turn-to satellite1 planet14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet14)
   goals met: 11 of 14
31. (take-image satellite1 planet14 instrument3 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 12 of 14
32. (turn-to satellite1 star10 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star10)
   goals met: 12 of 14
33. (take-image satellite1 star10 instrument3 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 13 of 14
34. (turn-to satellite1 star4 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star4)
   goals met: 14 of 14
